<?php get_header(); ?>

<main id="main" class="site-main single-main">

    <?php
    if (have_posts()) {
        while (have_posts()) {
            the_post();

            //get icon
            $flag_en = '<svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_1_504)">
            <path d="M24.5 2.65247H12.5V5.30186H24.5V2.65247Z" fill="white"/>
            <path d="M24.5 13.3501H12.5H0.5V15.9995H24.5V13.3501Z" fill="white"/>
            <path d="M24.5 8.00052H12.5V10.6499H24.5V8.00052Z" fill="white"/>
            <path d="M24.5 18.6997H0.5V21.3491H24.5V18.6997Z" fill="white"/>
            <path d="M24.5 2.65247V2.54009C24.5 1.66876 24.0613 0.900577 23.3931 0.443361C23.3885 0.440282 23.3839 0.435664 23.3793 0.432585C22.9744 0.158563 22.4864 0 21.9599 0H12.5V2.65247H24.5Z" fill="#E60012"/>
            <path d="M24.5 5.30032H12.5V8.00052H24.5V5.30032Z" fill="#E60012"/>
            <path d="M24.5 10.6499H12.5V13.3501H24.5V10.6499Z" fill="#E60012"/>
            <path d="M24.5 15.9995H0.5V16.001V18.6997H24.5V15.9995Z" fill="#E60012"/>
            <path d="M24.5 21.463V21.3491H0.5V21.4615C0.5 22.8639 1.63765 24.0015 3.04009 24.0015H21.9599C23.3623 24.0015 24.4985 22.8654 24.5 21.463V21.463Z" fill="#E60012"/>
            <path d="M12.5 10.6499V0H11.8242L11.2346 0.429506L11.464 1.13765L10.862 0.701988L10.2601 1.13765L10.4895 0.429506L9.89987 0H7.51527L6.92566 0.429506L7.15504 1.13765L6.55311 0.701988L5.95119 1.13765L6.18056 0.429506L5.59096 0H3.20635L2.61674 0.429506L2.84612 1.13765L2.24419 0.701988L1.64227 1.13765L1.87011 0.429506L1.76235 0.350994C1.13271 0.717383 0.681655 1.33932 0.544644 2.07364H1.0542L0.503079 2.47543C0.503079 2.49699 0.5 2.51854 0.5 2.53855V2.65555L0.681655 3.21899L0.5 3.08659V5.54971H1.0542L0.5 5.95459V6.13316L0.681655 6.6966L0.5 6.56421V9.2567H1.0542L0.5 9.66158V9.84015L0.681655 10.4036L0.5 10.2727V13.3486H12.5V10.6484V10.6499ZM2.83842 12.2586L2.2365 11.823L1.63457 12.2586L1.86241 11.5505L1.26203 11.1133H2.00558L2.2365 10.4051L2.46741 11.1117H3.21097L2.61058 11.5505L2.83996 12.2586H2.83842ZM2.60904 7.84349L2.83842 8.55164L2.2365 8.11597L1.63457 8.55164L1.86241 7.84349L1.26203 7.40475H2.00558L2.2365 6.6966L2.46741 7.40321H3.21097L2.61058 7.84195L2.60904 7.84349ZM2.60904 4.1365L2.83842 4.84464L2.2365 4.40898L1.63457 4.84464L1.86241 4.1365L1.26203 3.69776H2.00558L2.2365 2.98961L2.46741 3.69622H3.21097L2.61058 4.13496L2.60904 4.1365ZM4.99365 10.4051L4.39173 9.96947L3.7898 10.4051L4.01918 9.69699L3.41879 9.25824H4.16235L4.39327 8.5501L4.62418 9.2567H5.36774L4.76735 9.69545L4.99673 10.4036L4.99365 10.4051ZM4.76427 5.98999L4.99365 6.69814L4.39173 6.26248L3.7898 6.69814L4.01918 5.98999L3.41879 5.55279H4.16235L4.39327 4.84464L4.62418 5.55125H5.36774L4.76735 5.98999H4.76427ZM4.76427 2.51084L4.99365 3.21745L4.39173 2.78178L3.7898 3.21745L4.01918 2.51084L3.41879 2.07364H4.16235L4.39327 1.36549L4.62418 2.0721H5.36774L4.76735 2.51084H4.76427ZM7.14888 12.2586L6.54695 11.823L5.94503 12.2586L6.17441 11.5505L5.57402 11.1133H6.31758L6.54849 10.4051L6.77941 11.1117H7.52296L6.92258 11.5505L7.15196 12.2586H7.14888ZM6.9195 7.84349L7.14888 8.55164L6.54695 8.11597L5.94503 8.55164L6.17441 7.84349L5.57402 7.40475H6.31758L6.54849 6.6966L6.77941 7.40321H7.52296L6.92258 7.84195L6.9195 7.84349ZM6.9195 4.1365L7.14888 4.84464L6.54695 4.40898L5.94503 4.84464L6.17441 4.1365L5.57402 3.69776H6.31758L6.54849 2.98961L6.77941 3.69622H7.52296L6.92258 4.13496L6.9195 4.1365ZM9.3041 10.4051L8.70218 9.96947L8.10026 10.4051L8.32963 9.69699L7.72925 9.25824H8.4728L8.70372 8.5501L8.93464 9.2567H9.67819L9.07781 9.69545L9.30718 10.4036L9.3041 10.4051ZM9.07473 5.98999L9.3041 6.69814L8.70218 6.26248L8.10026 6.69814L8.32963 5.98999L7.72925 5.55279H8.4728L8.70372 4.84464L8.93464 5.55125H9.67819L9.07781 5.98999H9.07473ZM9.07473 2.51084L9.3041 3.21745L8.70218 2.78178L8.10026 3.21745L8.32963 2.51084L7.72925 2.07364H8.4728L8.70372 1.36549L8.93464 2.0721H9.67819L9.07781 2.51084H9.07473ZM11.4593 12.2586L10.8574 11.823L10.2555 12.2586L10.4849 11.5505L9.88448 11.1133H10.628L10.8589 10.4051L11.0899 11.1117H11.8334L11.233 11.5505L11.4624 12.2586H11.4593ZM11.23 7.84349L11.4593 8.55164L10.8574 8.11597L10.2555 8.55164L10.4849 7.84349L9.88448 7.40475H10.628L10.8589 6.6966L11.0899 7.40321H11.8334L11.233 7.84195L11.23 7.84349ZM11.23 4.1365L11.4593 4.84464L10.8574 4.40898L10.2555 4.84464L10.4849 4.1365L9.88448 3.69776H10.628L10.8589 2.98961L11.0899 3.69622H11.8334L11.233 4.13496L11.23 4.1365Z" fill="#0B318F"/>
            <path d="M10.2586 1.13765L10.8605 0.701989L11.4624 1.13765L11.233 0.429506L11.8242 0H9.89679L10.4864 0.429506L10.2586 1.13765Z" fill="white"/>
            <path d="M1.63306 1.13765L2.23498 0.701989L2.83691 1.13765L2.60753 0.429506L3.19714 0H3.03857C2.56904 0 2.1303 0.129314 1.75313 0.350994L1.86089 0.429506L1.63306 1.13765V1.13765Z" fill="white"/>
            <path d="M5.94655 1.13765L6.54847 0.701989L7.1504 1.13765L6.92102 0.429506L7.51217 0H6.50075H5.58478L6.17439 0.429506L5.94655 1.13765Z" fill="white"/>
            <path d="M10.8605 2.99115L10.6296 3.69776L9.88605 3.6993L10.4864 4.1365L10.2586 4.84465L10.8605 4.40898L11.4624 4.84465L11.2331 4.1365L11.835 3.6993L11.0914 3.69776L10.8605 2.99115Z" fill="white"/>
            <path d="M2.23649 2.99115L2.00558 3.69776L1.26202 3.6993L1.86241 4.1365L1.63303 4.84465L2.23649 4.40898L2.83842 4.84465L2.60904 4.1365L3.21097 3.6993L2.46741 3.69776L2.23649 2.99115Z" fill="white"/>
            <path d="M6.54851 2.99115L6.31759 3.69776L5.57404 3.6993L6.17442 4.1365L5.94658 4.84465L6.54851 4.40898L7.15043 4.84465L6.92105 4.1365L7.52298 3.6993L6.77942 3.69776L6.54851 2.99115Z" fill="white"/>
            <path d="M10.8605 6.69814L10.6296 7.40474L9.88605 7.40628L10.4864 7.84502L10.2586 8.55163L10.8605 8.11597L11.4624 8.55163L11.2331 7.84502L11.835 7.40628L11.0914 7.40474L10.8605 6.69814Z" fill="white"/>
            <path d="M2.23649 6.69814L2.00558 7.40474L1.26202 7.40628L1.86241 7.84502L1.63303 8.55163L2.23649 8.11597L2.83842 8.55163L2.60904 7.84502L3.21097 7.40628L2.46741 7.40474L2.23649 6.69814Z" fill="white"/>
            <path d="M6.54851 6.69814L6.31759 7.40474L5.57404 7.40628L6.17442 7.84502L5.94658 8.55163L6.54851 8.11597L7.15043 8.55163L6.92105 7.84502L7.52298 7.40628L6.77942 7.40474L6.54851 6.69814Z" fill="white"/>
            <path d="M11.0914 11.1133L10.8605 10.4051L10.6296 11.1133H9.88605L10.4864 11.552L10.2586 12.2602L10.8605 11.823L11.4624 12.2602L11.2331 11.552L11.835 11.1133H11.0914Z" fill="white"/>
            <path d="M2.46741 11.1133L2.23649 10.4051L2.00558 11.1133H1.26202L1.86241 11.552L1.63303 12.2602L2.23649 11.823L2.83842 12.2602L2.60904 11.552L3.21097 11.1133H2.46741Z" fill="white"/>
            <path d="M6.77942 11.1133L6.54851 10.4051L6.31759 11.1133H5.57404L6.17442 11.552L5.94658 12.2602L6.54851 11.823L7.15043 12.2602L6.92105 11.552L7.52298 11.1133H6.77942Z" fill="white"/>
            <path d="M4.39171 4.84465L4.16079 5.55126L3.41724 5.5528L4.01916 5.99154L3.78978 6.69815L4.39171 6.26248L4.99363 6.69815L4.76579 5.99154L5.36618 5.5528L4.62262 5.55126L4.39171 4.84465Z" fill="white"/>
            <path d="M0.5 6.1347V6.56729L0.681655 6.69814L0.5 6.1347Z" fill="white"/>
            <path d="M0.5 5.55125V5.95613L1.0542 5.55279L0.5 5.55125Z" fill="white"/>
            <path d="M8.70372 4.84465L8.4728 5.55126L7.72925 5.5528L8.33117 5.99154L8.10179 6.69815L8.70372 6.26248L9.30718 6.69815L9.07781 5.99154L9.67819 5.5528L8.93464 5.55126L8.70372 4.84465Z" fill="white"/>
            <path d="M4.62262 9.25978L4.39171 8.55164L4.16079 9.25978H3.41724L4.01916 9.69852L3.78978 10.4051L4.39171 9.96947L4.99363 10.4051L4.76579 9.69852L5.36618 9.25978H4.62262Z" fill="white"/>
            <path d="M0.5 9.25978V9.66466L1.0542 9.25978H0.5Z" fill="white"/>
            <path d="M0.5 9.84323V10.2743L0.681655 10.4051L0.5 9.84323Z" fill="white"/>
            <path d="M8.93464 9.25978L8.70372 8.55164L8.4728 9.25978H7.72925L8.33117 9.69852L8.10179 10.4051L8.70372 9.96947L9.30718 10.4051L9.07781 9.69852L9.67819 9.25978H8.93464Z" fill="white"/>
            <path d="M4.39171 1.36549L4.16079 2.07364L3.41724 2.07518L4.01916 2.51238L3.78978 3.22053L4.39171 2.78333L4.99363 3.22053L4.76579 2.51238L5.36618 2.07518L4.62262 2.07364L4.39171 1.36549Z" fill="white"/>
            <path d="M0.5 2.65709V3.08813L0.681655 3.22053L0.5 2.65709Z" fill="white"/>
            <path d="M0.544617 2.07364C0.519986 2.20449 0.506131 2.33842 0.503052 2.47543L1.05417 2.07364H0.544617V2.07364Z" fill="white"/>
            <path d="M8.70372 1.36549L8.4728 2.07364L7.72925 2.07518L8.33117 2.51238L8.10179 3.22053L8.70372 2.78333L9.30718 3.22053L9.07781 2.51238L9.67819 2.07518L8.93464 2.07364L8.70372 1.36549Z" fill="white"/>
            </g>
            <defs>
            <clipPath id="clip0_1_504">
            <rect width="24" height="24" fill="white" transform="translate(0.5)"/>
            </clipPath>
            </defs>
            </svg>
            ';

            $flag_th = '<svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_1_542)">
            <path d="M0.5 20.0005H24.5V21.715C24.5 22.9769 23.4769 24.001 22.214 24.001H2.786C1.52406 24.001 0.5 22.978 0.5 21.715V20.0005Z" fill="#C41621"/>
            <path d="M24.5 16H0.5V20.0005H24.5V16Z" fill="white"/>
            <path d="M24.5 8H0.5V16H24.5V8Z" fill="#2B296C"/>
            <path d="M24.5 4.0005H0.5V8.00101H24.5V4.0005Z" fill="white"/>
            <path d="M2.786 0H22.214C23.4759 0 24.5 1.02306 24.5 2.286V4.0005H0.5V2.286C0.5 1.02306 1.52306 0 2.786 0Z" fill="#C41621"/>
            </g>
            <defs>
            <clipPath id="clip0_1_542">
            <rect width="24" height="24" fill="white" transform="translate(0.5)"/>
            </clipPath>
            </defs>
            </svg>
            ';

            //get content-item
            $img = get_the_post_thumbnail($post->ID, array( 288, 432));
            if(!$img){$img='';}
            $title = get_the_title();

            //get acf field
            $number = get_field( "number");
            //$specialty = get_field( "specialty");
            $language = get_field( "language");
            $education = get_field( "Education");

            $specialty = wp_get_post_terms($post->ID, 'specialty', array("fields" => "all"));
            $sub_specialty = wp_get_post_terms($post->ID, 'sub_specialty', array("fields" => "all"));

            //get specialty
            /**if ( $specialty ) : 
                $specialtys = array();
                foreach ( $specialty as $s ) {  
                    $specialtys[] = '<span>'.$s.'</span>';
                }							
                $on_specialty = join( ", ", $specialtys);
            endif; **/

            if ( $specialty ) : 
                $specialtys = array();
                foreach ( $specialty as $s ) {  
                    $specialtys[] = '<span>'.$s->name.'</span>';
                }							
                $on_specialty = join( ", ", $specialtys);
            endif;

            if ( $sub_specialty ) : 
                $sub_specialtys = array();
                foreach ( $sub_specialty as $sub_s ) {  
                    $sub_specialtys[] = '<span>'.$sub_s->name.'</span>';
                }							
                $on_sub_specialty = join( ", ", $sub_specialtys);
            endif;


             //get language
             if ( $language ) : 
                $languages = array();
                foreach ( $language as $l ) {  
                    if($l == "English"){ 
                        $flag = $flag_en; 
                        $lang = 'อังกฤษ';
                    }elseif($l == "Thai"){
                        $flag = $flag_th; 
                        $lang = 'ไทย';
                    }elseif($l == "German"){
                        $flag = ''; 
                        $lang = 'เยอรมัน';
                    }else{
                        $flag = ''; 
                        $lang = 'จีน';
                    }
                    $languages[] = '<span>'.$flag.$lang.'</span>';
                }							
                $on_language = join( "", $languages);
            endif; 

        
            echo '<div class="single-content">';
    
                echo '<div class="banner">';
                    echo '<div class="doctor-item s-grid -d2">';
                        echo '<div class="pic">'.$img.'</div>';
                        echo '<div class="info">';
                            echo '<h2 class="entry-title">'.$title.'</h2>';
                            if($number){ echo '<div class="number s-sec">'.$on_specialty.'เลขที่ ว.  '.$number.'</div>'; }
                            if($specialty){ echo '<div class="spec s-sec">สาขา<h3>'.$on_specialty.'</h3></div>'; }
                            if($sub_specialty){ echo '<div class="sub-spec s-sec">ความชำนาญพิเศษ<h3>'.$on_sub_specialty.'</h3></div>'; }
                            if($language){ echo '<div class="lang s-sec">ภาษา<h3>'.$on_language.'</h3></div>'; }
                            if($education){ echo '<div class="edu s-sec">การศึกษา<h3>'.$education.'</h3></div>'; }
                            ?>
                            <div class="table-time">
                             <div class="h-table">
                                     <p>วันที่ออกตรวจ</p>
                                     <p>ช่วงเวลา</p>
                             </div>
                                 <?php if ( have_rows( 'doctor_time' ) ) : ?>
                                 <?php while ( have_rows( 'doctor_time' ) ) : the_row(); ?>
                                     <?php 
                                     echo'<div class="list"><p>จันทร์</p><p>';
                                     the_sub_field( 'monday' ); 
                                     echo'</p></div>';
                                     ?>
                                     <?php 
                                     echo'<div class="list"><p>อังคาร</p><p>';
                                     the_sub_field( 'tuesday' );
                                     echo'</p></div>';
                                     ?>
                                     <?php 
                                     echo'<div class="list"><p>พุธ</p><p>';
                                     the_sub_field( 'wednesday' );
                                     echo'</p></div>';
                                     ?>
                                     <?php 
                                     echo'<div class="list"><p>พฤหัสบดี</p><p>';
                                     the_sub_field( 'tuesday' );
                                     echo'</p></div>';
                                     ?>
                                     <?php 
                                     echo'<div class="list"><p>ศุกร์</p><p>';
                                     the_sub_field( 'friday' );
                                     echo'</p></div>'; 
                                     ?>
                                      <?php 
                                     echo'<div class="list"><p>เสาร์</p><p>';
                                     the_sub_field( 'saturday' );
                                     echo'</p></div>'; 
                                     ?>
                                      <?php 
                                     echo'<div class="list"><p>อาทิตย์</p><p>';
                                     the_sub_field( 'sunday' );
                                     echo'</p></div>'; 
                                     ?>
                                     <?php endwhile; ?>
                                 <?php else : ?>
                                     <?php // No rows found ?>
                                 <?php endif; ?>
                             </div>
                         <?php
                        echo '</div>';
                    echo '</div>';
                    
                echo '</div>';
                

                edit_post_link('EDIT', '', '', null, 'btn-edit');
            echo '</div>';
         

            the_content();
            
        }
    }
    ?>
   
  
</main>

<div class="s-consult">
    <h2>ปรึกษาแพทย์ออนไลน์</h2>
    <p>บริการตรวจรักษาออนไลน์ พร้อมบริการส่งยาถึงบ้านคุณอย่างต่อเนื่อง 
    โรงพยาบาลกรุงเทพสมุย “พัฒนาไม่หยุด สู่ขีดสุดของการดูแล”</p>
    <a class="button" href="/medical-service/telemedicine/">ดูรายละเอียด <span>›</span></a>
</div>

<?php get_footer(); ?>
